# Pandas Operation

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']
})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['col2'].unique()

array([444, 555, 666])

In [4]:
df['col1'].unique()

array([1, 2, 3, 4])

In [5]:
len(df['col1'].unique())

4

In [6]:
df['col1'].nunique() #number of unique values

4

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [10]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [14]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [15]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [16]:
def times2(x):
    return x*2

In [18]:
df['col1'].sum()

10

In [21]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [22]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [23]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [24]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [25]:
df.drop(1, axis=0)

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

In [29]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [31]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [34]:
df.sort_values(by='col2',ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [35]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [40]:
df['col1'][1]

nan

In [41]:
df

   col1  col2 col3
0   1.0   444  abc
1   NaN   555  def
2   3.0   666  ghi
3   4.0   444  xyz

In [42]:
df.isnull()

    col1   col2   col3
0  False  False  False
1   True  False  False
2  False  False  False
3  False  False  False

In [46]:
df['col1'][1] = 2
df['col3'][1]="abc"
df

/home/evazs/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  abc
2   3.0   666  ghi
3   4.0   444  xyz

In [50]:
df.pivot_table(values='col1', index=['col2'], columns=['col3'])

col3  abc  ghi  xyz
col2
444   1.0  NaN  4.0
555   2.0  NaN  NaN
666   NaN  3.0  NaN